{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<h2>Grievance Redressal</h2>\n<h4>1. Purpose</h4>\n<p>At RedCarpet, it is our constant endeavour to put customers interest first, give them money related arrangements that are directly for the Customers. The Purpose is to minimize customer complaints and grievances through proper service, delivery and review mechanism and to guarantee brief redressal of customer complaints and grievances.</p>\n<h4>2.Grievance Redressal Procedure</h4>\n<p>At RedCarpet customer Delight is our priority and we are committed to provide our customers Best in Class Experience. Customer service is extremely important for sustained business growth and as an organisation we endeavour to guarantee that our customers get excellent service across different touch points. </p>\n<p>The Company's policy on grievance redressal is governed by the following principles:\n1. Customer are treated fairly at all times.\n2.  Complaints raised by customers are dealt with courtesy and in a timely manner\n3. Employees works in good faith and without prejudice to the interest of the customers.\n4. Customers are informed of avenues to escalate their complaints within the organization, and their rights if they are not satisfied with the resolution of their complaints.\n<br>\nRedCarpet  provides to our customers information on various avenues (such as Branch, contact centre, email ids, etc.) to register their grievance and  best services to avoid any grievances.\nSpecific time schedules are set up for handling complaints and disposing them at all levels including branches, contact center and other avenues of escalations. Efforts are made at all levels of the grievance redressal mechanism to resolve the complaints within specified time frames defined by the organization.</p>\n<p>If in case customer is dissatisfied  or doesnot receive any response from our company, they may write in to help@redcarpet.cash or call on 011-71156232. You will receive an acknowledgment/response within 10 business days. Customers can write to us at and to</p>\n<p>RedCarpet Tech Pvt Ltd,\nBuilding 1,\nHundred Feet Road Ghitorni Metro Station,\nNew Delhi, Delhi 110030</p>\n<h4>3. Escalation Matrix</h4>\n<h3>Level 1:-</h3>\n<p>If a customer is not satisfied with the resolution provided through any of the above channels, he/she can write to the Founder's Office at help@redcarpetup.com\nCustomers are required to quote the complaint reference number provided to them in their earlier interaction to help us understand and address their concerns.</p>\n<h3>Level 2:-</h3>\n<p>A customer not satisfied with the response at Level 1, can further escalate the complaint to the below:-\nThe Officer Incharge,\nReserve Bank of India,\nDepartment of Non-Banking Supervision, Mumbai Regional Office, 3rd Floor, Rear Wing, Byculla,\nMumbai-400008</p>","excerpt":"Grievance Redressal1. PurposeAt RedCarpet, it is our constant endeavour to put customers interest first, give them money related arrangements that are directly for the Customers. The Purpose is to minimize customer complaints and grievances through…","id":"16551325-ae24-5e97-82f7-af78ecd3e9be","frontmatter":{"title":"Grievance Redressal Policy","date":"February 24, 2019"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}