{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<h1>Grievance Redressal Policy</h1>\n<h3>1.\tIntroduction</h3>\n<p>The Reserve Bank of India has prescribed broad guidelines on laying down of appropriate grievance redressal mechanism for all Non-Banking Finance Companies with regards to their dealings with customers.</p>\n<p>Redux Credit Finance Private Limited (hereinafter referred to as the ‘Company’) has formulated this Grievance Redressal Policy (‘Policy’) in conformity with the Master Direction issued by Reserve Bank of India (Master Direction DNBR. PD. 007/03.10.119/2016-17 dated September 1, 2016 and subsequent amendments).</p>\n<p>This Policy document aims to describe internal policy for handling customer complaints. It describes various channels for lodging the complaint and responding to customers within the committed time period. This policy has been approved by the Board of directors of the Company.</p>\n<h3>2.\tObjective of the Policy</h3>\n<p>The Company has devised this Policy with an objective to:</p>\n<ul>\n<li>Ensure that all concerns/complaints raised by customers are resolved in effective and timely manner;</li>\n<li>Create awareness amongst the customers of their rights to opt for alternative remedies if they are not fully satisfied with the company’s response or resolution to their complaint; and</li>\n<li>Ensure that due attention is paid to customer service and satisfaction and thereby, customer confidence in the company continues to grow.</li>\n</ul>\n<h3>3. Grievance Redressal Mechanism</h3>\n<h4>Mode for addressing the customer complaints</h4>\n<p> Complaints of the Customers can be registered by them using any of the 3 modes  given below:</p>\n<ol>\n<li>Customers can <strong>call</strong> on toll free number: <strong>011- 71156232</strong> (Monday - Friday, <br/> 10am - 5pm )  <strong>or</strong></li>\n<li><strong>Email</strong> at: support@reduxfinance.com</li>\n<li>\n<p><strong>Write (through a letter)</strong> to:</p>\n<blockquote>\n<p><strong>Redux Credit Finance Private Limited,\nFourth Floor, Balraj &#x26; Sons Building, 100 Feet Road,\nNear Ghitorni Metro Station,  New Delhi - 110030</strong> </p>\n</blockquote>\n</li>\n</ol>\n<h4>Important</h4>\n<ul>\n<li>Customers need to quote their loan account number in the complaint call/ email/ letter.</li>\n<li>Ticket Number received as an acknowledgement for the complaint received can be used by the customers for future communication.</li>\n<li>The Company should ensure that the customer queries/issues are addressed/resolved within 10 working days.</li>\n</ul>\n<h4>Escalation Process</h4>\n<p>  There can be instances where customers may not be satisfied with the service resolution specified as above.  <br/>   To further highlight such instances and register a complaint, the customers can follow the below process: </p>\n<table>\n<thead>\n<tr>\n<th>Escalation Level</th>\n<th>Mechanical Details</th>\n<th>Resolution turnaround time</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>FIRST LEVEL</strong></td>\n<td>Customer can opt for making a call/ writing an e-mail/ letter as specified above</td>\n<td>10 working days</td>\n<td></td>\n</tr>\n<tr>\n<td><strong>SECOND LEVEL</strong></td>\n<td>If the customer is not satisfied with the resolution provided at level 1 within 2 working days, the customer can approach the Grievance Redressal Officer ('GRO'). The name and contact number of GRO is as follows:  <br/> Kartik Venkataraman <br/> Contact No:-011-71156232 <br/> Days:- Monday-Friday<br/>Timings:- 10 am - 5 Pm</td>\n<td>GRO shall resolve the customer queries/issues with in 10 working days of receiving such complaint</td>\n<td></td>\n</tr>\n<tr>\n<td><strong>THIRD LEVEL</strong></td>\n<td>In case of non-redressal of the complaint to the customer's satisfaction or if the complaint is not addressed within a period of <strong>one month</strong>, the customer may appeal to the Officer-in-Charge of the Regional Office of Department of Non-Banking Supervision of the Reserve Bank of India, under whose jurisdiction the registered office of the company falls.                                      <br /> <strong>Officer-in-Charge,</strong> <br/>The Reserve Bank of India,<br/> Department of Non-Banking Supervision,<br/><strong>Address:</strong> 6, Sansad Marg,New Delhi-110001<br/><strong>Phone</strong>: 011-2371 4456/ 0538 <br /> <strong>Fax:</strong> 011-2375 2188<br /><strong>Email id:</strong> <a href=\"mailto:dnbsmro@rbi.org.in\"><strong>dnbsmro@rbi.org.in</strong></a></td>\n<td></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3>4. Supervision and Reporting</h3>\n<ul>\n<li>The Board of Directors shall nominate a senior level officer as GRO to ensure compliance of this policy.</li>\n<li>GRO to report to the Board of Directors with regard to the ageing of all the tickets with 'not closed' status on a periodical basis.</li>\n<li>The Board of Directors shall also nominate a senior level officer (GRO or any other person) for the purpose of tracking whether all complaints and the solutions provided for it have been accurately captured in the system. Further, such person shall also be held responsible for archiving any earlier complaint from the system for any future reference purpose.</li>\n</ul>\n<h3>5.\tLanguage and mode of communicating the Policy</h3>\n<ul>\n<li>This Policy will be provided in the English language and vernacular language if requested for, by any customer;</li>\n<li>The company will put up this policy on the website, for the information of customers; and</li>\n<li>The company will display, at all branches / places where business is transacted, the name and contact details (Telephone / Mobile nos. as also email address) of the GRO and the Officer-in-charge of RBI from the Department of Non-Banking Supervision who can be approached by the public for resolution of complaints against the company.</li>\n</ul>\n<h3>6.\tReview of Policy</h3>\n<ul>\n<li>This Policy will be reviewed and assessed on an annual basis or as and when there are any relevant regulatory developments. The Board of Directors will approve the revised policy and the changes if any, shall be communicated to the customers and relevant stakeholders as and when necessary.</li>\n</ul>","excerpt":"Grievance Redressal Policy1.\tIntroductionThe Reserve Bank of India has prescribed broad guidelines on laying down of appropriate grievance redressal mechanism for all Non-Banking Finance Companies with regards to their dealings with customers.Redux…","id":"16551325-ae24-5e97-82f7-af78ecd3e9be","frontmatter":{"title":"Grievance Redressal Policy","date":"February 24, 2019"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}